USE blog;

INSERT INTO user (name, email, password, sex, birthday, registration_date, role)
	VALUES('admin', 'admin@gmail.com', '8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918', 'MALE', '2000-01-01', '2015-03-10', 'ROLE_ADMIN');
	
INSERT INTO article (title, content, creation_date) VALUES
		("Фітнес", "Фітнес (анг. fitnes — стан здоров'я, придатність, доречність) медики перекладають як відповідність здоров'ю. Що ж потрібне для повної "
		"відповідності здоров'ю і красі? Краса, молодість — мета косметології. Краса для фахівця — це молодість, пружність, еластичність шкіри обличчя, "
		"шиї, всього тіла. Цих якостей шкіри можна досягати косметичними процедурами, масажем, обгортаннями, а також тренуванням м'язів."
		
		"\nСтан м'язової системи безпосередньо пов'язаний зі станом шкірного покриву. Якщо шкіра не в тонусі, то вона стає в'ялою, утворюються "
		"складки — зморшки. Нефункціонуючі, неробочі, нетреновані м'язи обвисають. М'язи, скорочуючись, перекачують великий об'єм крові, що несе "
		"поживні речовини, стимулюють обмінні процеси. Фахівцю необхідно знати механіку скорочення м'язів частин тіла, що його цікавлять, — від цього "
		"залежить відновлювальний ефект."

		"\nОтже, за допомогою роботи м'язів можна цілеспрямовано впливати на функціональний стан організму. Існує п'ять основних типів впливу: "
		"тонізуючий, заспокійливий, трофічний, енерготропний, нормалізуючий. Варто звернути увагу на енерготропний ефект і підвищення працездатності "
		"нервово-м'язового апарата. Конкретно у м'язах це виражається активізацією біоенергетики, поліпшенням обміну речовин, підвищенням "
		"утворення ацетилхоліну, що спричинює прискорення передачі нервового збудження на м'язові волокна, підвищенням утворення гістаміну, який "
		"розширює судини м'язів. При цьому поліпшується циркуляція крові.", "2015-03-29"),
		
		("Кросфіт – новітня універсальна система підготовки", "Хто з нас не хоче бути струнким, сильним, витривалим, швидким, гнучким, підтягнутим? Гадаю, більшість "
		"була б не проти мати такі якості. Добре, а тепер інформація для тих, хто справді готовий встати з дивана і зробити крок для досягнення цієї мети. "
		"Відповідь для вас: ідеальний засіб мати досконале тіло - це кросфіт."
		
		"\nКожен рух на межі можливого, постійна боротьба - з навантаженнями, з самим собою. Кожної секунди доводиться долати бажання зупинитися, кинути штангу, "
		"відпочити, але якщо ти розраховуєш на високі результати, не можна дозволити собі навіть найменшої паузи. Знайомтеся, кросфіт – комплекси з важкоатлетичних і "
		"гімнастичних вправ, аеробних навантажень, які виконуються максимально інтенсивно - тільки в цьому випадку можна розраховувати на хороший результат. Виявляється "
		"обласний центр Прикарпаття також має свій центр з кросфіту, розташований в клубі тайського боксу та мікс-файту «Бескид».", "2015-03-31"),
		
		("Бодібілдінг", "Бодібілдінг, як вид спорту, зародився у вічному прагненнілюдства до фізичної і духовної досконалості. Поняття досконалостілюдського тіла "
		"з'явилося ще в стародавньому світі. Ми можемо і сьогодні побачитипрекрасні зразки людської статури, відображені майстрами - скульпторами стародавнього "
		"Середземномор'я. Але в своїх творах майстравідображали не тільки зовнішню красу, але і багате внутрішній змістгероїв своїх творінь, підтвердженням чому "
		"служать описані в літературінезабутні образи Геркулеса, Антея, Ахілла та інших героїв. У стародавніхдержавах таких як, наприклад, Спарта, де найважливішим "
		"вважалосявиростити з людини справжнього воїна, величезна увага приділяласявсебічному розвитку. Фізичне виховання невід'ємно поєднувалося здуховним і розумовим "
		"розвитком."
		
		"\nСаме ця вічна ідея гармонійного розвитку особистості і лягла воснову сучасного бодібілдінгу. Але професійний спорт в будь-якому своємувигляді "
		"(будь то бодібілдінг, футбол і т.д.) - це світ рекордів імаксимального прояву можливостей людини. Часто спортсмен своїмдевізом ставить: результат за всяку ціну. "
		"Боротьба людських характерівперетворюється на боротьбу фармакологічних фірм, але це вже тема дляокремої розмови. Будь-який з вас стикався в повсякденному житті "
		"абобачив на телеекрані, рекламних плакатах, журналах спортсменів --бодібілдерів. Чому - то у більшості обивателів складаєтьсянеправильне ставлення до цього виду "
		"спорту як до даремне заняття,марної трати часу, бездумного нарощування мускулатури. Але насправдіза цими величезними м'язами коштує титанічна праця, регулярні "
		"тренування,залізна воля."
		
		"\nТільки людина, що володіє величезним прагненням, грунтовнимизнаннями з анатомії, фізіології, біохімії, дієтології, біомеханіки іістинним бажанням, зможе досягти "
		"високих результатів у цьому спорті.)", "2015-03-30");
				
INSERT INTO image (path, name) VALUES
		('src/main/webapp/WEB-INF/pages/image_article/', '1.jpg'),
		('src/main/webapp/WEB-INF/pages/image_article/', '3.jpg'),
		('src/main/webapp/WEB-INF/pages/image_article/', '4.jpg');
		
INSERT INTO article_image (article_id, image_id, paragraph)  VALUES
		('1', '1', '2'),
		('3', '3', '1'),
		('3', '1', '2'),
		('3', '2', '3');
	